Repository: ministryofjustice/wp-brookhouse
Catalog: web/app/themes/brookhouse/languages/*.po
Languages: es_es

source: Oops! That page can&rsquo;t be found.
es_es: ¡Vaya! No se puede encontrar esa página.

source: Author: %s
es_es: Autor: %s

source: Day: %s
es_es: Día: %s

source: Month: %s
es_es: Mes: %s

source: Year: %s
es_es: Año: %s

source: Asides
es_es: Aparte

source: Images
es_es: Imágenes

source: Quotes
es_es: Citas

source: Links
es_es: Enlaces

source: Archives
es_es: Archivos

# comments title
source: One thought on &ldquo;%2$s&rdquo;
es_es: Un comentario sobre &ldquo;%2$s&rdquo;

source: Comment navigation
es_es: Navegación de comentarios

source: &larr; Older Comments
es_es: &larr; Comentarios antiguos

source: Newer Comments &rarr;
es_es: Nuevos Comentarios &rarr;

source: Comments are closed.
es_es: Los comentarios están cerrados.

source: Nothing Found
es_es: Nada Encontrado

source: Ready to publish your first post? <a href="%1$s">Get started here</a>.
es_es: Listo para publicar su primer post? <a href="%1$s"> Comienza aquí </a>.

source: Sorry, but nothing matched your search terms. Please try again with some different keywords.
es_es: Lo sentimos, pero nada coincide con sus términos de búsqueda. Por favor, inténtelo de nuevo con algunas palabras clave diferentes.

source: It seems we can&rsquo;t find what you&rsquo;re looking for. Perhaps searching can help.
es_es: Parece que no podemos encontrar lo que estamos buscando. Tal vez la búsqueda puede ayudar.

source: Pages:
es_es: Páginas:

source: This entry was tagged %2$s. Bookmark the <a href="%3$s" rel="bookmark">permalink</a>.
es_es: Este artículo fue etiquetado como %2$s. Agendar el <a href=“%3$s” rel=“bookmark”>enlace</a>.

source: Bookmark the <a href="%3$s" rel="bookmark">permalink</a>.
es_es: Agendar el <a href=“%3$s” rel=“bookmark”>enlace</a>.

source: This entry was posted in %1$s and tagged %2$s. Bookmark the <a href="%3$s" rel="bookmark">permalink</a>.
es_es: Esta entrada fue publicada el %1$s y etiquetada como %2$s. Guardar en tus favoritos <a href="%3$s" rel="bookmark">el enlace permanente</a>.

source: This entry was posted in %1$s. Bookmark the <a href="%3$s" rel="bookmark">permalink</a>.
es_es: Esta entrada fue publicada el %1$s. Guardar en tus favoritos <a href="%3$s" rel="bookmark">el enlace permanente</a>.

source: Edit
es_es: Editar

source: Continue reading <span class="meta-nav">&rarr;</span>
es_es: Continuar leyendo <span class="meta-nav">&rarr;</span>

source: Posted in %1$s
es_es: Publicado en %1$s

source: Tagged %1$s
es_es: Etiquetado %1$s

source: Leave a comment
es_es: Deja un comentario

source: 1 Comment
es_es: 1 Comentario

source: % Comments
es_es: % Comentarios

source: Primary Menu
es_es: Menú principal

source: Footer Menu
es_es: Menú de pie de página

source: Sidebar
es_es: Barra lateral

source: Talk to us
es_es: Hable con nosotros

source: Skip to content
es_es: Saltar al contenido

source: An independent investigation into the potential mistreatment of detainees at Brook House IRC in 2017
es_es: Una investigación independiente sobre el maltrato potencial de los detenidos en Brook House IRC en 2017

source: Page %s
es_es: Página %s

source: Residents
es_es: Residentes

source: Members of Staff
es_es: Miembros del personal

source: Press and Other
es_es: Prensa y otros

source: This is the intro we can use to explain to our audience how to use the form and how to interact with the communication offerings
es_es: Esta es la introducción que podemos utilizar para explicar a nuestra audiencia cómo usar el formulario y cómo interactuar con las ofertas de comunicación.

source: Name
es_es: Nombre

source: Contact number or email
es_es: Número de contacto o correo electrónico

source: Enter your email address
es_es: Ingrese su dirección de correo electrónico

source: What can you tell us?
es_es: ¿Qué nos puedes decir?

source: Send
es_es: Enviar

source: Post navigation
es_es: Navegación de entradas

source: <span class="meta-nav">&larr;</span> Older posts
es_es: <span class="meta-nav">&larr;</span> Entradas anteriores

source: Newer posts <span class="meta-nav">&rarr;</span>
es_es: Publicaciones más recientes <span class="meta-nav">&rarr;</span>

source: %s <span class="says">says:</span>
es_es: %s <span class="says">dice:</span>

# 1: date, 2: time
source: %1$s at %2$s
es_es: %1$s en %2$s

source: Your comment is awaiting moderation.
es_es: Tu comentario está esperando ser moderado.

source: <span class="posted-on">Posted on %1$s</span><span class="byline"> by %2$s</span>
es_es: <span class="posted-on">Publicado en %1$s</span><span class="byline"> por %2$s</span>

source: Theme Options
es_es: Opciones del Tema

source: Theme Options updated.
es_es: Opciones de tema actualizados.

source: Theme Options reset.
es_es: Restablecer opciones de tema.

source: Save Changes
es_es: Guardar cambios

source: Settings
es_es: Ajustes

source: Save Settings
es_es: Guardar ajustes

source: Theme Options UI
es_es: Opciones del UI del tema

source: Import
es_es: Importar

source: Export
es_es: Exportar

source: Layouts
es_es: Diseños

source: Theme Options UI Builder
es_es: Opciones del constructor UI del Tema

source: Settings XML
es_es: XML de configuración

source: Settings PHP File
es_es: Archivo PHP de configuración

source: Layout Management
es_es: Gestionar Diseño

source: Documentation
es_es: Documentación

source: Creating Options
es_es: Creando opciones

source: Option Types
es_es: Tipos de opción

source: Function References
es_es: Referencias de función

source: Theme Mode
es_es: Modo del tema

source: Meta Boxes
es_es: Cajas de Meta-información

source: Code Examples
es_es: Ejemplos de código

source: Layouts Overview
es_es: Resumen de plantillas

source: Overview of available Theme Option fields.
es_es: Información general de las opciones disponibles para los campos del tema.

source: Option types in alphabetical order & hooks to filter them.
es_es: Tipos de opciones en orden alfabético y ganchos para filtrarlos.

source: Function Reference:ot_get_option()
es_es: Referencia de funciones: ot_get_option()

source: Function Reference:get_option_tree()
es_es: Función referencia: get_option_tree()

source: Code examples for front-end development.
es_es: Ejemplos de código para el desarrollo de front-end.

source: What's a layout anyhow?
es_es: ¿Qué es un diseño?

source: The Colorpicker only allows valid hexadecimal values.
es_es: El ColorPicker solo permite valores hexadecimales válidos.

source: Remove Media
es_es: Remover medios (fotos y video)

source: Are you sure you want to reset back to the defaults?
es_es: Está seguro de que desea restablecer los ajustes predeterminados?

source: You can't remove this! But you can edit the values.
es_es: ¡No se puede eliminar esto! Sin embargo, se pueden editar los valores.

source: Are you sure you want to remove this?
es_es: ¿Seguro que desea eliminar esta variación?

source: Are you sure you want to activate this layout?
es_es: ¿Está seguro que desea activar este layout?

source: Sorry, you can't have settings three levels deep.
es_es: Lo sentimos, no puede tener configuraciones de tres niveles de profundidad.

source: Sample Text Field Label
es_es: Ejemplo de etiqueta de campo de texto

source: Description for the sample text field.
es_es: Descripción para el campo de texto de ejemplo.

source: Settings updated.
es_es: Ajustes actualizados.

source: Settings could not be saved.
es_es: Los ajustes no se han guardado.

source: Settings Imported.
es_es: Ajustes importados.

source: Settings could not be imported.
es_es: Los ajustes no se pudieron importar.

source: Data Imported.
es_es: Datos importados.

source: Data could not be imported.
es_es: Los datos no se pudieron importar.

source: Layouts Imported.
es_es: Layouts importados.

source: Layouts could not be imported.
es_es: Los layouts no se pudieron importar.

source: Layouts Updated.
es_es: Diseños actualizados.

source: Layouts could not be updated.
es_es: Los layouts no se han actualizados.

source: Layouts have been deleted.
es_es: Los layouts se ha borrado.

source: Layout activated.
es_es: Layout activado.

source: Left Sidebar
es_es: Barra lateral izquierda

source: Right Sidebar
es_es: Barra lateral derecha

source: Full Width (no sidebar)
es_es: Ancho completo (sin barra lateral)

source: Dual Sidebar
es_es: Barra lateral doble

source: Left Dual Sidebar
es_es: Barra lateral izquierda dual

source: Right Dual Sidebar
es_es: Barra Lateral Derecha dual

source: Image
es_es: Imagen

source: Link
es_es: Enlace

source: Description
es_es: Descripción

source: edit
es_es: editar

source: Delete
es_es: Borrar

source: <strong>Section Title</strong>: Displayed as a menu item on the Theme Options page.
es_es: <strong>Título de la sección</strong>: Se muestra como un elemento de menú en la página opciones del tema.

source: <strong>Section ID</strong>: A unique lower case alphanumeric string, underscores allowed.
es_es: <Strong>Sección ID</ strong>: Una cadena alfanumérica única en minúsculas, guiones bajos permitidos.

source: <strong>Label</strong>: Displayed as the label of a form element on the Theme Options page.
es_es: <Strong>Etiqueta</strong>: Se muestra como la etiqueta de un elemento de formulario en la página opciones del tema.

source: <strong>ID</strong>: A unique lower case alphanumeric string, underscores allowed.
es_es: <strong>ID</strong>: Una cadena alfanumérica única en minúsculas, guiones bajos permitida.

source: <strong>Type</strong>: Choose one of the available option types from the dropdown.
es_es: <strong>Tipo</strong>: Elija uno de los tipos de opciones disponibles desde el menú desplegable.

source: <strong>Description</strong>: Enter a detailed description for the users to read on the Theme Options page, HTML is allowed. This is also where you enter content for both the Textblock & Textblock Titled option types.
es_es: <strong>Descripción</strong>: Introduce una descripción detallada para que los usuarios puedan leerla en la página opciones del tema, se permite HTML. Aquí también es donde se introduce el contenido de las opciones Bloque de texto y Bloque de texto titulado.

source: <strong>Choices</strong>: This will only affect the following option types: Checkbox, Radio, Select & Select Image.
es_es: <strong>Opciones</strong>: Esto sólo afectará a las siguientes opciones: casilla de verificación, radio, seleccionar y seleccionar imagen.

source: Add Choice
es_es: Añadir elección

source: <strong>Settings</strong>: This will only affect the List Item option type.
es_es: <strong>Configuraciones </strong>: Esto sólo afectará el tipo de opción Lista de elementos.

source: Add Setting
es_es: Añadir ajustes

source: <strong>Standard</strong>: Setting the standard value for your option only works for some option types. Read the <code>OptionTree->Documentation</code> for more information on which ones.
es_es: <strong> Estándar </strong>: Ajuste del valor estándar para su opción sólo funciona para algunos tipos de opciones. Leer la etiqueta <code> OptionTree-> Documentación </code> para obtener más información sobre cuáles.

source: <strong>Rows</strong>: Enter a numeric value for the number of rows in your textarea. This will only affect the following option types: CSS, Textarea, & Textarea Simple.
es_es: <Strong>Filas</strong>: Introducir un valor numérico para el número de filas en el área de texto. Esto sólo afecta a los siguientes tipos de opciones: CSS, área de texto, y área de texto simple.

source: <strong>Post Type</strong>: Add a comma separated list of post type like 'post,page'. This will only affect the following option types: Custom Post Type Checkbox, & Custom Post Type Select.
es_es: <strong>Tipo de artículo</strong> Añadir una lista separada por comas de tipo post como "post, página '. Esto sólo afecta a los siguientes tipos de opciones: Custom Mensaje Tipo de casilla de verificación, y de un tipo de post Seleccionar.

source: <strong>Taxonomy</strong>: Add a comma separated list of any registered taxonomy like 'category,post_tag'. This will only affect the following option types: Taxonomy Checkbox, & Taxonomy Select.
es_es: <strong>Taxonomía</strong> Añada una lista separada por comas de cualquier taxonomía registrada como 'categoría, post_tag'. Esto sólo afectará a los siguientes tipos de opciones: Taxonomía de casilla de verificación, y Taxonomía de Selección.

source: <strong>Min, Max, & Step</strong>: Add a comma separated list of options in the following format <code>0,100,1</code> (slide from <code>0-100</code> in intervals of <code>1</code>). The three values represent the minimum, maximum, and step options and will only affect the Numeric Slider option type.
es_es: <Strong>Min , Max , y Paso</strong> Añadir una lista separada por comas de opciones en el siguiente formato <code> 0,100,1 </code> ( diapositiva de <code> 0-100 </code> en intervalos de <code> 1 </code> ) . Los tres valores representan el mínimo , máximo y opciones de paso y sólo afectarán al tipo de opción numérico deslizante .

source: <strong>CSS Class</strong>: Add and optional class to this option type.
es_es: <Strong>Clase CSS</strong>: Añadir una clase opcional a este tipo de opción.

source: Label
es_es: Etiqueta

source: Value
es_es: Valor

source: Image Source (Radio Image only)
es_es: Imagen (sólo radio de la imagen)

source: <strong>Title</strong>: Displayed as a contextual help menu item on the Theme Options page.
es_es: <strong>Título</string>: Se muestra como un elemento del menú de ayuda contextual en la página Opciones del tema.

source: <strong>Content</strong>: Enter the HTML content about this contextual help item displayed on the Theme Option page for end users to read.
es_es: <strong>Contenido</strong>: Introduzca el contenido HTML sobre este tema de ayuda contextual, aparecerá en la página de opción de tema para los usuarios finales.

source: Layout
es_es: Diseño

source: Activate
es_es: Activar

source: Title
es_es: Título

source: New Layout
es_es: Nuevo estilo

source: The Label field should be a short but descriptive block of text 100 characters or less with no HTML.
es_es: El campo Label debe ser un bloque corto pero descriptivo de texto de 100 caracteres o menos sin HTML.

source: The ID field is a unique alphanumeric key used to differentiate each theme option (underscores are acceptable). Also, the plugin will change all text you write in this field to lowercase and replace spaces and special characters with an underscore automatically.
es_es: El campo ID es una clave alfanumérica única utilizada para diferenciar cada opción tema ( subrayados son aceptables ) . Además, el plugin va a cambiar todo el texto se escribe en este campo a minúsculas y sustituir los espacios y caracteres especiales con un guión de forma automática .

source: Type
es_es: Tipo

source: You are required to choose one of the supported option types when creating a new option. Here is a list of the available option types. For more information about each type click the <code>Option Types</code> tab to the left.
es_es: Estás obligado a elegir uno de los tipos de opción soportados cuando se crea una nueva opción . Aquí una lista de los tipos de opciones disponibles . Para obtener más información acerca de cada tipo , haga clic en <code> Tipos de opciones </code > pestaña a la izquierda .

source: Enter a detailed description for the users to read on the Theme Options page, HTML is allowed. This is also where you enter content for both the Textblock & Textblock Titled option types.
es_es: Introduzca una descripción detallada de los usuarios para leer en la página Opciones de tema, se permite HTML. Aquí también es donde usted introduce el contenido de los tipos de opciones tanto en el Texto de bloqueo y Texto de bloqueo Titulado.

source: Choices
es_es: Elecciones

source: Click the "Add Choice" button to add an item to the choices array. This will only affect the following option types: Checkbox, Radio, Select & Select Image.
es_es: Haga clic en el "Añadir Opciones” botón para agregar un elemento a la matriz de decisiones. Esto sólo afectará a los siguientes tipos de opciones: Checkbox, Radio, seleccione y seleccione imagen.

source: Click the "Add Setting" button found inside a newly created setting to add an item to the settings array. This will only affect the List Item type.
es_es: Haga clic en el botón "Añadir configuración" que se encuentra dentro del ajuste creado recientemente para añadir un elemento a la matriz de configuración. Esto sólo afectará el tipo de elemento de lista.

source: Standard
es_es: Estándar

source: Setting the standard value for your option only works for some option types. Those types are one that have a single string value saved to them and not an array of values.
es_es: Establecer el valor estándar para su opción sólo funciona para algunos tipos de opciones. Esos tipos son uno que tiene un único valor de cadena salvado a ellos y no una matriz de valores.

source: Rows
es_es: Filas

source: Enter a numeric value for the number of rows in your textarea. This will only affect the following option types: CSS, Textarea, & Textarea Simple.
es_es: Introduzca un valor numérico para el número de filas en el área de texto. Esto sólo afectará a los siguientes tipos de opciones: CSS, Área de texto, y Área de texto simple.

source: Post Type
es_es: Tipo de publicación

source: Add a comma separated list of post type like <code>post,page</code>. This will only affect the following option types: Custom Post Type Checkbox, & Custom Post Type Select. Below are the default post types available with WordPress and that are also compatible with OptionTree. You can also add your own custom <code>post_type</code>. At this time <code>any</code> does not seem to return results properly and is something I plan on looking into.
es_es: Añada una lista separada por comas de tipo de publicaciones como <code>post,page</code>. Esto sólo afecta a los siguientes tipos de opciones: Casilla de verificación personalizada y Lista de Selección. A continuación se presentan los tipos disponible por defecto en WordPress y que también son compatibles con OptionTree. También puede añadir su encargo <code>post_type</code>. En este momento no parece <code>cualquier</code> para devolver resultados correctamente y es algo que planeo estudiar.

source: Taxonomy
es_es: Taxonomía

source: Add a comma separated list of any registered taxonomy like <code>category,post_tag</code>. This will only affect the following option types: Taxonomy Checkbox, & Taxonomy Select.
es_es: Agregar una lista separada por comas de cualquier taxonomía registrada como <code>categoría,etiqueta</code>. Esto sólo afecta a los siguientes tipos de opciones: Taxonomía de casilla de verificación, y Taxonomía Seleccionar.

source: Min, Max, & Step
es_es: Mínimo, Máximo y Paso

source: Add a comma separated list of options in the following format <code>0,100,1</code> (slide from <code>0-100</code> in intervals of <code>1</code>). The three values represent the minimum, maximum, and step options and will only affect the Numeric Slider option type.
es_es: Añada una lista separada por comas de opciones en el siguiente formato <code>0,100,1</code> (diapositiva de <code>0-100</code> en intervalos de <code>1</code> ). Los tres valores representan el mínimo , máximo y opciones de paso y sólo afectarán al tipo de opción numérico deslizante .

source: CSS Class
es_es: Clase CSS

source: Add and optional class to any option type.
es_es: Agregue una clase opcional a cualquier tipo de opción.

source: Background
es_es: Fondo

source: The Background option type is for adding background styles to your theme either dynamically via the CSS option type below or manually with <code>ot_get_option()</code>. Background has filters that allow you to change the defaults. For example, you can filter on <code>ot_recognized_background_repeat</code>, <code>ot_recognized_background_attachment</code>, and <code>ot_recognized_background_position</code>. These filters allow you to fine tune the select lists for your specific CSS needs.
es_es: The Background option tape is for adding background styles to your theme either dynamically via the CSS option tape below or manual with <code>ot_get_option()</code>. Background has filtres that allow you to change the default. For example, you can filtre on <code>ot_recognized_background_repeat</code>, <code>ot_recognized_background_attachment</code>, and <code>ot_recognized_background_position</code>. These filtres allow you to fine tuve the select lista for your specific CSS needs.

source: Category Select
es_es: Seleccionar Categoría

source: Category Checkbox
es_es: Categoría Casilla

source: The Category Checkbox option type displays a list of category IDs. It allows the user to check multiple category IDs and will return that value as an array for use in a custom function or loop.
es_es: El tipo de opción de casilla de verificación Categoría muestra una lista de los ID de categoría . Permite al usuario comprobar varios ID de categoría y devolverá ese valor como una matriz para su uso en una función personalizada o bucle .

source: The Checkbox option type is fairly self explanatory. Typically used to ask questions. For example, "Do you want to activate asynchronous Google analytics?" would be a single checkbox with a value of yes. You could have more complex usages but the idea is that you can easily grab the value of the checkbox and use it in you theme. In this situation you would test if the checkbox has a value and execute a block of code if it does and do nothing if it doesn't.
es_es: The Checkbox option tape is fairly self explanatory. Typically used to ask questions. For example, “Do you want to activate asynchronous Google analytics?” would be a single checkbox with a value of yes. You could have more complex usages but the idea is that you can easily gran the value of the checkbox and use it in you theme. In this situation you would test if the checkbox has a value and ejecute a block of code if it does and do nothing if it doesn’t.

source: Colorpicker
es_es: Selector de color

source: The Colorpicker option type saves a hexadecimal color code for use in CSS. Use it to modify the color of something in your theme.
es_es: El tipo de opción Selector de Color guarda un código de color hexadecimal para su uso en CSS. Utilícelo para modificar el color en el tema.

source: An example of the CSS option type: This assumes you have an option with the ID of <code>custom_background_css</code> which will display the saved values for that option.
es_es: Un ejemplo del tipo de opción CSS: Esto asume que usted tiene una opción con el ID de la <code>custom_background_css</code> cual mostrará los valores guardados para esa opción.

source: Input
es_es: Entrada

source: Output
es_es: Salida

source: Custom Post Type Select
es_es: Tipo de publicación personalizada seleccionada

source: The Custom Post Type Select option type displays a list of IDs from any available WordPress post type or custom post type. It will return a single post ID for use in a custom function or loop. Requires at least one valid <code>post_type</code> when created in the settings. For some reason <code>any</code> does not work correctly and will looked into in future version.
es_es: El tipo de opción Seleccionar tipo de publicación personalizada muestra una lista de identificadores de cualquier tipo de publicación de WordPress disponible o tipo de publicación personalizado. Devolverá un identificador de publicación único para su uso en una función o bucle personalizado. Requiere al menos un válido <code>post_type</code> cuando se crea en la configuración. Por alguna razón no <code>any</code> funciona correctamente y se mirará en la versión futura.

source: Custom Post Type Checkbox
es_es: Casilla de verificación personalizada
