Repository: ministryofjustice/wp-brookhouse
Catalog: web/app/themes/brookhouse/languages/*.po
Languages: es_es

source: Adding a layout is ridiculously easy, follow these steps and you'll be on your way to having a WordPress super theme.
es_es: Agregar un diseño es muy fácil, siga estos pasos y pronto tendrá un súper tema de WordPress.

source: For Developers
es_es: Para desarrolladores

source: Creating a Layout
es_es: Crear una plantilla

source: Go to the <code>OptionTre->Settings->Layouts</code> tab.
es_es: Vaya a la pestaña <code> OptionTre-> Settings-> Layouts </code>.

source: Enter a name for your layout in the text field and hit "Save Layouts", you've created your first layout.
es_es: Introduzca un nombre para su diseño en el campo de texto y pulse "Guardar diseños", ha creado su primer diseño.

source: Adding a new layout is as easy as repeating the steps above.
es_es: Agregar un nuevo diseño es tan fácil como repetir los pasos anteriores.

source: Activating a Layout
es_es: Activar una Plantilla

source: Click on the activate layout button in the actions list.
es_es: Haga clic en el botón de activar diseño en la lista de acciones.

source: Deleting a Layout
es_es: Eliminar un diseño

source: Click on the delete layout button in the actions list.
es_es: Haga clic en el botón Eliminar diseño de la lista de acciones.

source: Edit Layout Data
es_es: Editar Plantilla

source: Go to the <code>Appearance->Theme Options</code> page.
es_es: Ir a la página <code>Apariencia ->Opciones de Tema</code>.

source: Modify and save your theme options and the layout will be updated automatically.
es_es: Modifique y guarde las opciones del tema y el diseño se actualizará automáticamente.

source: Saving theme options data will update the currently active layout, so before you start saving make sure you want to modify the current layout.
es_es: Al guardar los datos de las opciones del tema se actualizará el diseño activo actual, por lo que antes de empezar a guardar, asegúrese de que desea modificar el diseño actual.

source: If you want to edit a new layout, first create it then save your theme options.
es_es: Si desea editar un nuevo diseño, primero cree y luego guarde las opciones del tema.

source: End-Users Mode
es_es: Modo de usuario final

source: Enter a name for your layout in the text field and hit "New Layout", you've created your first layout.
es_es: Introduzca un nombre para su diseño en el campo de texto y pulse "Nuevo diseño", ha creado su primer diseño.

source: Choose a layout from the select list and click the "Activate Layout" button.
es_es: Elija un diseño de la lista de selección y haga clic en el botón "Activar diseño".

source: End-Users mode does not allow deleting layouts.
es_es: El modo de usuario final no permite borrar diseños.

source: Go to the <code>Appearance->Theme Options</code> tab.
es_es: Vaya a la pestaña <code> Apariencia-> Opciones de tema </ code>.

source: How-to-guide
es_es: Guía

source: There are a few simple steps you need to take in order to use OptionTree's built in Meta Box API. In the code below I'll show you a basic demo of how to create your very own custom meta box using any number of the option types you have at your disposal. If you would like to see some demo code, there is a directory named <code>theme-mode</code> inside the <code>assets</code> directory that contains a file named <code>demo-meta-boxes.php</code> you can reference.
es_es: Hay algunos pasos simples que usted necesita tomar para utilizar OptionTree construido en Meta Box API. En el siguiente código te mostraré una demostración básica de cómo crear tu propia caja de meta personalizada usando cualquier número de tipos de opción que tengas a tu disposición. Si desea ver algún código de demostración, hay un directorio llamado <code> theme-mode </code> dentro del directorio <code> assets </code> que contiene un archivo denominado <code> demo-meta-boxes.php </code> puede hacer referencia.

source: It's important to note that Meta Boxes do not support WYSIWYG editors at this time and if you set one of your options to Textarea it will automatically revert to a Textarea Simple until a valid solution is found. WordPress released this statement regarding the wp_editor() function:
es_es: Es importante tener en cuenta que Meta Boxes no son compatibles con los editores WYSIWYG en este momento y si establece una de sus opciones en Textarea automáticamente volverá a Textarea Simple hasta que se encuentre una solución válida. WordPress publicó esta declaración con respecto a la función wp_editor():

source: Once instantiated, the WYSIWYG editor cannot be moved around in the DOM. What this means in practical terms, is that you cannot put it in meta-boxes that can be dragged and placed elsewhere on the page.
es_es: Una vez instanciado, el editor WYSIWYG no se puede mover en el DOM. Lo que esto significa en términos prácticos, es que no se puede poner en meta-boxes que se pueden arrastrar y colocar en otra parte de la página.

source: Create and include your custom meta boxes file.
es_es: Cree e incluya su archivo personalizado de cuadros de meta.

source: Create a file and name it anything you want, maybe <code>meta-boxes.php</code>.
es_es: Crear un archivo y el nombre de lo que quieras, tal vez <code>meta-boxes.php</code>.

source: As well, you'll probably want to create a directory named <code>includes</code> to put your <code>meta-boxes.php</code> into which will help keep you file structure nice and tidy.
es_es: Además, probablemente querrá crear un directorio denominado <code>includes</code> para poner su <code>meta-boxes.php</code> en el que le ayudará a mantener la estructura de archivos agradable y ordenada.

source: Add the following code to your <code>functions.php</code>.
es_es: Agregue el siguiente código a su <code>functions.php</code>.

source: Add a variation of the following code to your <code>meta-boxes.php</code>. You'll obviously need to fill it in with all your custom array values. It's important to note here that we use the <code>admin_init</code> filter because if you were to call the <code>ot_register_meta_box</code> function before OptionTree was loaded the sky would fall on your head.
es_es: Agregue una variación del siguiente código a su <code>meta-boxes.php</code>. Obviamente, tendrá que rellenar con todos sus valores de arrays personalizados. Es importante tener en cuenta que usamos el filtro <code>admin_init</code> porque si llamas a la función <code>ot_register_meta_box</code> antes de cargar el OptionTree, el cielo caerá sobre tu cabeza.

source: There are a few simple steps you need to take in order to use OptionTree as a theme included module. In the code below I'll show you a basic demo of how to include the entire plugin as a module, which will allow you to have the most up-to-date version of OptionTree without ever needing to hack the core of the plugin. If you would like to see some demo code, there is a directory named <code>theme-mode</code> inside the <code>assets</code> directory that contains a file named <code>demo-theme-options.php</code> you can reference.
es_es: Hay algunos pasos simples que usted necesita tomar con el fin de utilizar la opción de árbol como tema incluido módulo. En el código de abajo te voy a mostrar una demostración básica de cómo incluir a todo el plugin como un módulo, lo que permitirá que usted tenga la versión más actualizada de la opción del árbol sin ni siquiera tenga que cortar el núcleo del plugin . Si desea ver algo de código de demostración, hay un directorio llamado <code> tema en modo </ code> dentro de <code> activos </ code> directorio que contiene un archivo llamado <code> Demo-theme-opciones. php </ code> se puede hacer referencia.

source: Step 1: Include the plugin & turn on theme mode.
es_es: Paso 1: Incluir el plugin y activar el modo de tema.

source: Download the latest version of <a href="http://wordpress.org/extend/plugins/option-tree/" rel="nofollow" target="_blank">OptionTree</a>.
es_es: Descargue la última versión de <a href=”http://wordpress.org/extend/plugins/option-tree/” rel=”nofollow” target=”_blank”>OptionTree</a>.

source: Unpack the ZIP archive.
es_es: Descomprima el archivo ZIP.

source: Put the <code>option-tree</code> directory in the root of your theme. For example, the server path would be <code>/wp-content/themes/theme-name/option-tree/</code>.
es_es: Coloque el <code>option-tree</code> directorio en la raíz de su tema. Por ejemplo, la ruta del servidor sería <code>/wp-content/themes/theme-name/option-tree/</code> .

source: Add the following code to the beginning of your <code>functions.php</code>.
es_es: Agregue el siguiente código al principio de su <code>functions.php</code> .

source: It's that simple! You now have OptionTree built into your theme and anytime there's an update to the plugin you just replace the old version and you're good to go..
es_es: ¡ Es así de simple! Ahora tiene OptionTree integrado en su tema y en cualquier momento hay una actualización del plugin que acaba de reemplazar la versión antigua y que está bien para ir..

source: Step 2: Create Theme Options without using the UI Builder.
es_es: Paso 2: Crear opciones de tema sin usar el generador de interfaz de usuario.

source: Create a file and name it anything you want, maybe <code>theme-options.php</code>, or use the built in file export to create it for you. Remember, you should always check the file for errors before including it in your theme.
es_es: Cree un archivo y póngale el nombre que desee, tal vez <code>theme-options.php</code> o utilice la exportación de archivos integrada para crearla. Recuerde, siempre debe comprobar el archivo de los errores antes de incluirlo en su tema.

source: As well, you'll probably want to create a directory named <code>includes</code> to put your <code>theme-options.php</code> into which will help keep you file structure nice and tidy.
es_es: Además, probablemente querrá crear un directorio con el nombre <code>includes</code> para poner su <code>theme-options.php</code> en el que le ayudará a mantener la estructura de archivos agradable y ordenada.

source: Add a variation of the following code to your <code>theme-options.php</code>. You'll obviously need to fill it in with all your custom array values for contextual help (optional), sections (required), and settings (required).
es_es: Agregue una variación del siguiente código a su <code>theme-options.php</code>. Es obvio que necesitarás rellenarlo con todos tus valores de arrays personalizados para ayuda contextual (opcional), secciones (requeridas) y configuraciones (requeridas).

source: The code below is a boilerplate to get your started. For a full list of the available option types click the "Option Types" tab above. Also a quick note, you don't need to put OptionTree in theme mode to manually create options but you will want to hide the docs and settings as each time you load the admin area the settings be written over with the code below if they've changed in any way. However, this ensures your settings do not get tampered with by the end-user.
es_es: El código a continuación es un boilerplate para comenzar. Para obtener una lista completa de los tipos de opción disponibles, haga clic en la pestaña "Tipos de opciones" anterior. También una nota rápida, no es necesario poner OptionTree en el modo de tema para crear manualmente opciones, pero usted querrá ocultar los documentos y la configuración como cada vez que carga el área de administración de la configuración se escriben con el código de abajo si ' Hemos cambiado de alguna manera. Sin embargo, esto garantiza que el usuario final no altere su configuración.

source: Sorry, this function does not exist
es_es: Lo siento, esta función no existe

source: background-position
es_es: posición del fondo

source: Add Media
es_es: Agregar multimedia

source: No Categories Found
es_es: No se han encontrado categorías

source: Choose One
es_es: Elige uno

source: No Posts Found
es_es: No se han encontrado publicaciones

source: Add New
es_es: Añadir nuevo

source: You can re-order with drag & drop, the order will update after saving.
es_es: Puede reordenar con arrastrar y soltar, la orden se actualizará después de guardar.

source: No Pages Found
es_es: No se encontraron páginas

source: Choose Sidebar
es_es: Elija la barra lateral

source: No Sidebars
es_es: No hay barras laterales

source: No Tags Found
es_es: No se han encontrado etiquetas

source: No Taxonomies Found
es_es: No se encontraron taxonomías

source: Warning!
es_es: ¡Advertencia!

source: Go to the %s page if you want to save data, this page is for adding settings.
es_es: Vaya a la página %s si desea guardar datos, esta página es para agregar ajustes.

source: If you're unsure or not completely positive that you should be editing these settings, you should read the %s first.
es_es: Si no está completamente seguro de editar estos ajustes, debería leer primero el %s.

source: Things could break or be improperly displayed to the end-user if you do one of the following:
es_es: Las cosas podrían romperse o ser mostradas incorrectamente al usuario final si usted hace uno de lo siguiente:

source: Give two sections the same ID, give two settings the same ID, give two contextual help content areas the same ID, don't create any settings, or have a section at the end of the settings list.
es_es: Dar a dos secciones el mismo ID, dar dos configuraciones el mismo ID, dar dos áreas de contenido de ayuda contextual el mismo ID, no crear ninguna configuración, o tener una sección al final de la lista de configuración.

source: You can create as many settings as your project requires and use them how you see fit. When you add a setting here, it will be available on the Theme Options page for use in your theme. To separate your settings into sections, click the "Add Section" button, fill in the input fields, and a new navigation menu item will be created.
es_es: Puede crear tantas configuraciones como su proyecto requiere y usarlos cómo mejor le parezca. Cuando se agrega aqui un ajuste aquí, estará disponible en la página opciones para ser usado en tu tema. Para separar la configuración en secciones, haga clic en el botón “Añadir sección”, rellene los campos de entrada, y se creará un nuevo elemento de menú de navegación.

source: All of the settings can be sorted and rearranged to your liking with Drag & Drop. Don't worry about the order in which you create your settings, you can always reorder them.
es_es: Todos los ajustes se pueden ordenar y reorganizar a tu gusto con Drag & Drop. No te preocupes por el orden en que creas tus configuraciones, siempre puedes reordenarlas.

source: Add Section
es_es: Añadir sección

source: Contextual Help
es_es: Ayuda contextual

source: Contextual Help Sidebar
es_es: Barra lateral de ayuda contextual

source: If you decide to add contextual help to the Theme Option page, enter the optional "Sidebar" HTML here. This would be an extremely useful place to add links to your themes documentation or support forum. Only after you've added some content below will this display to the user.
es_es: Si decide agregar ayuda contextual a la página de opciones del tema, introduzca el código HTML de la "barra lateral" aquí. Esto sería un lugar muy útil para añadir enlaces a la documentación de temas o foro de soporte. Sólo después de añadir algo de contenido, estará disponible para el usuario.

source: Add Contextual Help Content
es_es: Añadir ayuda contextual al contenido

source: This import method has been deprecated. That means it has been replaced by a new method and is no longer supported, and may be removed from future versions. All themes that use this import method should be converted to use its replacement below.
es_es: Este método de importación es obsoleto. Esto significa ya no es compatible y que ha sido reemplazado por un nuevo método y puede ser eliminado en futuras versiones. Todos los temas que utilizan este método de importación deben cambiarse para usar los que se encuentran en la parte inferior.

source: If you were given a Theme Options XML file with a premium or free theme, locate it on your hard drive and upload that file by clicking the blue upload button. A popup window will appear, upload the XML file and click "Send to OptionTree". The file URL should be in the upload input, if it is click "Import XML".
es_es: Si le dieron un archivo XML con opciones del tema premium o tema libre, localice en su disco duro y cargue el archivo haciendo clic en el botón de subir. Aparecerá una ventana emergente, cargue el archivo XML y haga clic “%s”. El archivo de la URL debe estar en la entrada de carga, si es así haga clic en “Importar XML”.

source: Import XML
es_es: Importar XML

source: Add XML
es_es: Añadir XML

source: To import your Settings copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Settings" button.
es_es: Para importar tus opciones del tema copiar y pegar lo que parece ser una cadena aleatoria de caracteres alfa numéricos en esta área de texto y pulse el boton ”Importar Opcione del Tema”.

source: Import Settings
es_es: Importar ajustes

source: Only after you've imported the Settings should you try and update your Theme Options.
es_es: Sólo después de haber importado los ajustes debe tratar de actualizar sus Opciones del tema.

source: To import your Theme Options copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Theme Options" button.
es_es: Para importar las opciones del tema copiar y pegar lo que parece ser una cadena aleatoria de caracteres alfanuméricos en esta área de texto y pulse el botón "Importar opciones del tema".

source: Import Theme Options
es_es: Importar opciones del tema

source: Only after you've imported the Settings should you try and update your Layouts.
es_es: Sólo después de haber importado los ajustes debes tratar de actualizar sus diseños.

source: To import your Layouts copy and paste what appears to be a random string of alpha numeric characters into this textarea and press the "Import Layouts" button. Keep in mind that when you import your layouts, the active layout's saved data will write over the current data set for your Theme Options.
es_es: Para importar sus plantillas copia y pega lo que parece ser una cadena aleatoria de caracteres alfanuméricos en esta área de texto y pulsa el botón "importar formatos". Toma en cuenta que al importar la plantilla, ésta se escribirá sobre el conjunto de datos actual para sus opciones de tema.

source: Import Layouts
es_es: Importar diseños

source: Export your Settings into a fully functional <code>theme-options.php</code> file by clicking this button. For more information on how to use this file read the theme mode %s. Remember, you should always check the file for errors before including it in your theme.
es_es: Exporte su configuración a un archivo completamente funcional <code>theme-options.php</code> haciendo clic en este botón. Para obtener más información sobre cómo utilizar este archivo, lea el modo de tema %s. Recuerde, siempre debe comprobar el archivo de errores antes de incluiarlo en su tema.

source: Export Settings File
es_es: Archivo de configuración exportar

source: Export your Settings by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Settings</strong> textarea on another web site.
es_es: Exporta tus ajustes resaltando este texto y copiar/pegar en un archivo .txt vacío. A continuación, guarda el archivo para importarlo posteriormente en otra instalación de WordPress. Alternativamente, sólo puedes pegarlo en el <code> OptionTree-> Configuración-> Importar </ code> <strong> configuración </ strong> textarea en otro sitio web.

source: Export your Theme Options data by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Theme Options</strong> textarea on another web site.
es_es: Exporta las opciones de tema resaltando este texto y haciendo una copia/pega en un archivo .txt vacío. A continuación, guarda el archivo para importarlo posteriormente en otra instalación de WordPress. Alternativamente, puedes pegarlo en la <code> OptionTree-> Configuración-> Importar </ code> <strong> Opciones de tema </ strong> textarea en otro sitio web.

source: Export your Layouts by highlighting this text and doing a copy/paste into a blank .txt file. Then save the file for importing into another install of WordPress later. Alternatively, you could just paste it into the <code>OptionTree->Settings->Import</code> <strong>Layouts</strong> textarea on another web site.
es_es: Exporta tus diseños resaltando este texto y haciendo una copia / pega en un archivo .txt vacío. A continuación, guarda el archivo para importarlo posteriormente en otra instalación de WordPress. Alternativamente, puede pegarlo en la zona de texto <code> OptionTree-> Settings-> Import </ code> <strong> Layouts </ strong> en otro sitio web.

source: To add a new layout enter a unique lower case alphanumeric string (dashes allowed) in the text field and click "Save Layouts".
es_es: Para añadir un nuevo diseño, ingrese una cadena alfanumérica en minúsculas (guiones permitidos) en el campo de texto y haz clic en "Guardar diseños".

source: As well, you can activate, remove, and drag & drop the order; all situations require you to click "Save Layouts" for the changes to be applied.
es_es: Además, puede activar, eliminar, arrastrar y soltar el pedido; cualquiera de las opciones requieren que hagas clic en "Guardar diseños" para que los cambios se apliquen.

source: When you create a new layout it will become active and any changes made to the Theme Options will be applied to it. If you switch back to a different layout immediately after creating a new layout that new layout will have a snapshot of the current Theme Options data attached to it.
es_es: Al crear un nuevo diseño, se activará y se le aplicarán los cambios realizados en las opciones del tema. Si cambia de nuevo a un diseño diferente inmediatamente después de crear un nuevo diseño, el nuevo diseño tendrá una captura de pantalla de los datos de opciones del tema actuales adjuntos al mismo.

source: Visit <code>OptionTree->Documentation->Layouts Overview</code> to see a more in-depth description of what layouts are and how to use them.
es_es: Visita <code>OptionTree-> Documentation-> Layouts Overview </code> para ver una descripción más detallada de lo que son los diseños y cómo usarlos.

source: Save Layouts
es_es: Guardar estilos

source: Reset Options
es_es: Restablecer opciones

source: Search Results for: %s
es_es: Resultados de búsqueda para: %s

# label
source: Search for:
es_es: Buscar:

# placeholder
source: Search &hellip;
es_es: Buscar &hellip;

# submit button
source: Go
es_es: Ir
