Repository: ministryofjustice/wp-brookhouse
Catalog: web/app/themes/brookhouse/languages/*.po
Languages: es_es

source: The Custom Post Type Select option type displays a list of IDs from any available WordPress post type or custom post type. It allows the user to check multiple post IDs for use in a custom function or loop. Requires at least one valid <code>post_type</code> when created in the settings. For some reason <code>any</code> does not work correctly and will looked into in future version.
es_es: El tipo de opción Seleccionar tipo de publicación personalizada muestra una lista de identificadores de cualquier tipo de publicación de WordPress disponible o tipo de publicación personalizado. Permite al usuario comprobar varios identificadores de entrada para su uso en una función o bucle personalizado. Requiere al menos un válido <code>post_type</code> cuando se crea en la configuración. Por alguna razón no <code>any</code> funciona correctamente y se mirará en la versión futura.

source: List Item
es_es: Elemento de la lista

source: The list Item replaced the old Slider option type. It allows for a great deal of customization. You can add settings to the List Item and those settings will be displayed to the user when they add a new List Item. Typical use is for creating sliding content or blocks of code for custom layouts.
es_es: La lista elemento reemplaza el antiguo tipo de opción de slider. Permite una gran cantidad de personalización. Puede Agregar la configuración al elemento de lista y esos ajustes se mostrarán al usuario cuando agreguen un nuevo elemento de lista. El uso típico es para crear contenido deslizante o bloques de código para diseños personalizados.

source: Measurement
es_es: Medida

source: The Measurement option type is a mix of input and select fields. The text input excepts a value and the select lets you choose the unit of measurement to add to that value. Currently the default units are <code>px</code>, <code>%</code>, <code>em</code>, <code>pt</code>. However, you can change them with the <code>ot_measurement_unit_types</code> filter.
es_es: El tipo de opción de medición es una mezcla de campos de entrada y selección. La entrada de texto excepciona un valor y la selección le permite elegir la unidad de medida que desea añadir a ese valor. Actualmente las unidades predeterminadas son <code>px</code> ,,, <code>%</code> <code>em</code> <code>pt</code> . Sin embargo, puede cambiarlos con el <code>ot_measurement_unit_types</code> filtro.

source: Example filter to add new units to the Measurement option type. Added to <code>functions.php</code>.
es_es: Ejemplo de filtro para agregar nuevas unidades al tipo de opción de medición. Añadido a <code>functions.php</code> .

source: Example filter to completely change the units in the Measurement option type. Added to <code>functions.php</code>.
es_es: Ejemplo de filtro para cambiar completamente las unidades en el tipo de opción de medición. Añadido a <code>functions.php</code> .

source: Numeric Slider
es_es: Deslizador numerico

source: The Numeric Slider option type displays a jQuery UI slider. It will return a single numerical value for use in a custom function or loop.
es_es: El deslizador numérico muestra un control deslizante jQuery UI . Se devolverá un valor numérico único para su uso en una función personalizada o bucle .

source: Page Select
es_es: Selección de página

source: The Page Select option type displays a list of page IDs. It will return a single page ID for use in a custom function or loop.
es_es: La opción de selección de página, muestra una lista de IDs de página. Mostrará un único ID de página para su uso en una función personalizada o bucle.

source: Page Checkbox
es_es: Casilla para verificación de página

source: The Page Select option type displays a list of page IDs. It allows the user to check multiple page IDs for use in a custom function or loop.
es_es: El tipo de opción seleccionar página muestra una lista de identificadores de página. Permite al usuario comprobar varios identificadores de página para usarlos en una función o bucle personalizado.

source: Post Select
es_es: Seleccionar publicación

source: The Post Select option type displays a list of post IDs. It will return a single post ID for use in a custom function or loop.
es_es: La casilla seleccionar publicación muestra una lista de los ID de las publicaciones. Mostrará un solo ID para su uso en una función personalizada o bucle.

source: Post Checkbox
es_es: Casilla de artículo

source: The Post Select option type displays a list of post IDs. It allows the user to check multiple post IDs for use in a custom function or loop.
es_es: El tipo de opción post SELECT muestra una lista de identificadores de entrada. Permite al usuario comprobar varios identificadores de entrada para su uso en una función o bucle personalizado.

source: The Radio option type could ask a question. For example, "Do you want to activate the custom navigation?" could require a yes or no answer with a radio option. In this situation you would test if the radio has a value of 'yes' and execute a block of code, or if it's 'no' execute a different block of code.
es_es: El tipo de opción radio podría hacer una pregunta. Por ejemplo, "¿desea activar la navegación personalizada?" podría requerir una respuesta sí o no con una opción de radio. En esta situación se probaría si la radio tiene un valor de "sí" y ejecutar un bloque de código, o si es ' no ' ejecutar un bloque de código diferente.

source: Radio Image
es_es: Imagen de la opción radio

source: the Radio Images option type is primarily used for layouts. However, you can filter the image list using <code>ot_radio_images</code>. As well, you can add your own custom images using the choices array.
es_es: el tipo de opción de imágenes de radio se utiliza principalmente para las presentaciones. Sin embargo, puede filtrar la lista de imágenes utilizando <code>ot_radio_images</code> . Además, puede agregar sus propias imágenes personalizadas mediante la matriz Choices.

source: This example executes the <code>ot_radio_images</code> filter on layout images attached to the <code>my_radio_images</code> field. Added to <code>functions.php</code>.
es_es: En este ejemplo se ejecuta el <code>ot_radio_images</code> filtro en las imágenes de diseño adjuntas al <code>my_radio_images</code> campo. Añadido a <code>functions.php</code> .

source: Select
es_es: Seleccionar

source: The Select option type is used to list anything you want that would be chosen from a select list.
es_es: La opción seleccionar se utiliza para enumerar lo que quiera que pueda elegirse de una lista de selección.

source: Sidebar Select
es_es: Selector de barra lateral

source: This option type makes it possible for users to select a WordPress registered sidebar to use on a specific area. By using the two provided filters, <code>ot_recognized_sidebars</code>, and <code>ot_recognized_sidebars_{$field_id}</code> we can be selective about which sidebars are available on a specific content area.
es_es: Este tipo de opción hace posible que los usuarios seleccionen una barra lateral registrada de WordPress para usarla en un área específica. Mediante el uso de los dos filtros proporcionados, <code>ot_recognized_sidebars</code> y podemos <code>ot_recognized_sidebars_{$field_id}</code> ser selectivos sobre qué barras laterales están disponibles en un área de contenido específico.

source: For example, if we create a WordPress theme that provides the ability to change the Blog Sidebar and we don't want to have the footer sidebars available on this area, we can unset those sidebars either manually or by using a regular expression if we have a common name like <code>footer-sidebar-$i</code>.
es_es: Por ejemplo, si creamos un tema de WordPress que proporciona la capacidad de cambiar la barra lateral del blog y no queremos tener las barras laterales de pie de página disponibles en esta área, podemos Desestablecer esas barras laterales manualmente o usando una expresión regular si tenemos un nombre común como <code>footer-sidebar-$i</code>.

source: The Slider option type is technically deprecated. Use the List Item option type instead, as it's infinitely more customizable. Typical use is for creating sliding image content.
es_es: El tipo de opción Slider está técnicamente obsoleto. Utilice el tipo de opción de elemento de lista en su lugar, ya que es infinitamente más personalizable. El uso típico es para crear contenido de imagen deslizante.

source: Tag Checkbox
es_es: Casilla de verificación de etiqueta

source: The Tag Checkbox option type displays a list of tag IDs. It allows the user to check multiple tag IDs and will return that value as an array for use in a custom function or loop.
es_es: La casilla de verificación de etiquetas muestra una lista de etiquetas de ID. Permite al usuario comprobar varios ID de etiqueta y devolverá ese valor como una matriz para su uso en una función personalizada o bucle.

source: Tag Select
es_es: Seleccion de etiqueta

source: The Tag Select option type displays a list of tag IDs. It allows the user to select only one tag ID and will return that value for use in a custom function or loop.
es_es: La opción de etiqueta seleccionada muestra una lista IDs de etiquetas. Permite al usuario seleccionar un solo ID de la etiqueta y devolverá ese valor para su uso en una función personalizada o bucle.

source: Taxonomy Checkbox
es_es: Casilla de verificación de taxonomía

source: The Taxonomy Checkbox option type displays a list of taxonomy IDs. It allows the user to check multiple taxonomy IDs and will return that value as an array for use in a custom function or loop.
es_es: La opción de casilla de verificación taxonomía muestra una lista de los IDs de taxonomía. Permite al usuario comprobar varios IDs de taxonomía y devolverá ese valor como una matriz para su uso en una función personalizada o bucle.

source: Taxonomy Select
es_es: Selector de taxonomía

source: The Taxonomy Select option type displays a list of taxonomy IDs. It allows the user to select only one taxonomy ID and will return that value for use in a custom function or loop.
es_es: La opción de taxonomía seleccionada muestra una lista de IDs de taxonomía. Permite al usuario seleccionar una ID de taxonomía y devolverá ese valor para su uso en una función personalizada o bucle.

source: The Text option type would be used to save a string value. For example, a link to feedburner, your Twitter username, or Google Analytics ID are all good candidates. Any optional or required text that is of reasonably short character length.
es_es: El Text tipo de opción se utiliza para guardar un valor de cadena. Por ejemplo, un enlace a Feedburner, su nombre de usuario de Twitter o el ID de Google Analytics son buenos candidatos. Cualquier texto opcional o requerido que tenga una longitud de caracteres razonablemente corta.

source: Textarea
es_es: Área de texto

source: The Textarea option type is a large string value used for custom code or text in the theme. The new Textarea has a WYSIWYG editor that can be filtered to change the buttons shown. For example, you can filter on <code>wpautop</code>, <code>media_buttons</code>, <code>tinymce</code>, and <code>quicktags</code>.
es_es: El tipo de opción TextArea es un valor de cadena grande que se utiliza para el código o texto personalizado en el tema. El nuevo TextArea tiene un editor WYSIWYG que se puede filtrar para cambiar los botones mostrados. Por ejemplo, puede filtrar por <code>wpautop</code> ,, <code>media_buttons</code> <code>tinymce</code> y <code>quicktags</code> .

source: Example filters to alter the Textarea option type. Added to <code>functions.php</code>.
es_es: Ejemplo filtra para alterar el tipo de opción Área de texto. Sumado a <code>functions.php</code>.

source: This example keeps WordPress from executing the <code>wpautop</code> filter on the line breaks. The default is <code>true</code> which means it wraps line breaks with an HTML <code>p</code> tag.
es_es: Este ejemplo evita que WordPress ejecute el <code>wpautop</code> filtro en los saltos de línea. El valor predeterminado es <code>true</code> lo que significa que envuelve saltos de línea con una <code>p</code> etiqueta HTML.

source: This example keeps WordPress from executing the <code>media_buttons</code> filter on the textarea WYSIWYG. The default is <code>true</code> which means show the buttons.
es_es: Este ejemplo evita que WordPress ejecute el <code>media_buttons</code> filtro en la TextArea WYSIWYG. El valor predeterminado es <code>true</code> Qué significa mostrar los botones.

source: This example keeps WordPress from executing the <code>tinymce</code> filter on the textarea WYSIWYG. The default is <code>true</code> which means show the tinymce.
es_es: Este ejemplo evita que WordPress ejecute el <code>tinymce</code> filtro en la TextArea WYSIWYG. El valor por defecto es <code>true</code> Qué significa mostrar el TinyMCE.

source: This example alters the <code>quicktags</code> filter on the textarea WYSIWYG. The default is <code>array( 'buttons' => 'strong,em,link,block,del,ins,img,ul,ol,li,code,spell,close' )</code> which means show those quicktags. It also means you can filter in your own custom quicktags.
es_es: Este ejemplo altera el <code>quicktags</code> filtro en el TextArea WYSIWYG. El valor predeterminado es <code>array( 'buttons' => 'strong,em,link,block,del,ins,img,ul,ol,li,code,spell,close' )</code> Qué significa mostrar esas etiquetas rápidas. También significa que puede filtrar en sus propias quicktags personalizadas.

source: Textarea Simple
es_es: Área de texto simple

source: The Textarea Simple option type is a large string value used for custom code or text in the theme. The new Textarea Simple does not have a WYSIWYG editor. But you can still filter on <code>wpautop</code>.
es_es: El tipo de opción simple TextArea es un valor de cadena grande utilizado para el código o texto personalizado en el tema. El nuevo TextArea simple no tiene un editor WYSIWYG. Pero todavía se puede filtrar <code>wpautop</code> .

source: This example tells WordPress to execute the <code>wpautop</code> filter on the line breaks. The default is <code>false</code> which means it does not wraps line breaks with an HTML <code>p</code> tag. Added to <code>functions.php</code>.
es_es: Este ejemplo le dice a WordPress que ejecute el <code>wpautop</code> filtro en los saltos de línea. El valor predeterminado es <code>false</code> lo que significa que no encapsula saltos de línea con una <code>p</code> etiqueta HTML. Añadido a <code>functions.php</code> .

source: Textblock
es_es: Bloque de texto

source: The Textblock option type is used only on the Theme Option page. It will allow you to create & display HTML on your Theme Options page but has no title above the text block. You can then use the Textblock to add a more detailed set of instruction on how the options are used in your theme. You would NEVER use this in your themes template files as it does not save a value.
es_es: El TextBlock tipo de opción se utiliza sólo en la opción de tema página. Le permitirá crear y mostrar HTML en su página de opciones de tema, pero no tiene título por encima del bloque de texto. A continuación, puede utilizar el bloque de texto para agregar un conjunto más detallado de instrucciones sobre cómo se utilizan las opciones en su tema. NUNCA usaría esto en los archivos de plantilla de temas, ya que no guarda un valor.

source: Textblock Titled
es_es: Bloque de texto titulado

source: The Textblock Titled option type is used only on the Theme Option page. It will allow you to create & display HTML on your Theme Options page and has a title above the text block. You can then use the Textblock Titled to add a more detailed set of instruction on how the options are used in your theme. You would NEVER use this in your themes template files as it does not save a value.
es_es: El TextBlock titulado tipo de opción se utiliza sólo en la opción de tema página. Le permitirá crear y mostrar HTML en su página de opciones de tema y tiene un título por encima del bloque de texto. A continuación, puede utilizar el bloque de texto titulado para agregar un conjunto más detallado de instrucciones sobre cómo se utilizan las opciones en su tema. NUNCA usaría esto en los archivos de plantilla de temas, ya que no guarda un valor.

source: Typography
es_es: Tipografía

source: This example would filter <code>ot_recognized_font_families</code> to build your own font stack. Added to <code>functions.php</code>.
es_es: Este ejemplo filtraría <code>ot_recognized_font_families</code> para crear su propia pila de fuentes. Añadido a <code>functions.php</code> .

source: Upload
es_es: Subir

source: The Upload option type is used to upload any WordPress supported media. After uploading, users are required to press the "Send to OptionTree" button in order to populate the input with the URI of that media. There is one caveat of this feature. If you import the theme options and have uploaded media on one site the old URI will not reflect the URI of your new site. You'll have to re-upload or FTP any media to your new server and change the URIs if necessary.
es_es: El tipo de opción Upload se utiliza para cargar cualquier Wordpress sustratos admitidos. Tras la descarga, los usuarios deben presionar el botón de “Enviar a OptionTree” con el fin de poblar la entrada con el URI de que los medios de comunicación. Hay una advertencia de esta característica. Si importa las opciones del tema y han subido los medios de comunicación en un sitio antiguo URI no reflejará la URI de su nuevo sitio. Vas a tener que volver a subir o FTP cualquier medio a su nuevo servidor y cambiar los URI si es necesario.

source: This function returns a value from the "option_tree" array of saved values or the default value supplied. The returned value would be mixed. Meaning it could be a string, integer, boolean, or array.
es_es: Esta función devuelve un valor de la "option_tree" matriz de valores guardados o el valor predeterminado suministrado. El valor devuelto se mezclaría. Lo que significa que podría ser una cadena, entero, booleano, o matriz.

source: Usage
es_es: Uso

source: Parameters
es_es: Parámetros

source: string
es_es: cadena

source: required
es_es: requerido

source: Enter the options unique identifier.
es_es: Introduzca el identificador único de las opciones.

source: Default:
es_es: Por defecto:

source: None
es_es: Ninguno

source: optional
es_es: opcional

source: Enter a default return value. This is just incase the request returns null.
es_es: Introduzca un valor de retorno predeterminado. Esto es sólo en caso de peticiones devueltas nulas.

source: Default
es_es: Por defecto

source: This function has been deprecated. That means it has been replaced by a new function or is no longer supported, and may be removed from future versions. All code that uses this function should be converted to use its replacement.
es_es: Esta función ha quedado obsoleta. Esto significa que ha sido reemplazado por una nueva función o ya no es compatible, y puede eliminarse de las versiones futuras. Todo el código que usa esta función debe convertirse para usar su reemplazo.

source: Use
es_es: Usar

source: instead
es_es: en vez

source: This function returns, or echos if asked, a value from the "option_tree" array of saved values.
es_es: Esta función devuelve, o echos si se solicita, un valor de la matriz "option_tree" de valores guardados.

source: Enter a unique Option Key to get a returned value or array.
es_es: Introducir una única Clave Opción para obtener un valor o una matriz.

source: Used to cut down on database queries in template files.
es_es: Se utiliza para reducir las consultas de base de datos en archivos de plantilla.

source: Echo the output.
es_es: Eco de la salida.

source: Used to indicate the $item_id is an array of values.
es_es: Se utiliza para indicar que $item_id es un array de valores.

source: integer
es_es: entero

source: Numeric offset key for the $item_id array, -1 will return all values (an array starts at 0).
es_es: La llave de compensación numérica para el $item_id la serie,-1 devolverá todos los valores (una serie comienza en 0).

source: If you're using the plugin version of OptionTree it is highly recommended to include a <code>function_exists</code> check in your code, as described in the examples below. If you've integrated OptionTree directly into your themes root directory, you will <strong>not</strong> need to wrap your code with <code>function_exists</code>, as you're guaranteed to have the <code>ot_get_option()</code> function available.
es_es: Si usted usa la versión de pluging de OptionTree sumamente le recomiendan incluir un <code>function_exists</code> facturan su código, como descrito en los ejemplos debajo. Si usted se ha integrado OptionTree directamente en sus temas arraiga el directorio, usted va a <strong>no</strong> tiene que abrigarse su código con el <code>function_exists</code>, como usted es garantizado para tener el <code>ot_get_option () </code> la función disponible.

source: String Examples
es_es: Ejemplos de cuerdas

source: Returns the value of <code>test_input</code>.
es_es: Devuelve el valor de <code>test_input</code> .

source: Returns the value of <code>test_input</code>, but also has a default value if it returns empty.
es_es: Devuelve el valor de <code>test_input</code> , pero también tiene un valor predeterminado si devuelve Empty.

source: Array Examples
es_es: Ejemplos de Array

source: Assigns the value of <code>navigation_ids</code> to the variable <code>$ids</code>. It then echos an unordered list of links (navigation) using <code>wp_list_pages()</code>.
es_es: Asigna el valor de <code>navigation_ids</code> a la variable <code>$ids</code>. Entonces echos una lista desordenada de enlaces (navegación) usando <code>wp_list_pages()</code>.

source: The next two examples demonstrate how to use the <strong>Measurement</strong> option type. The Measurement option type is an array with two key/value pairs. The first is the value of measurement and the second is the unit of measurement.
es_es: Los siguientes dos ejemplos demuestran cómo usar el tipo de opción <strong> Medición </ strong>. El tipo de opción Measurement es un array con dos pares clave / valor. El primero es el valor de la medición y el segundo es la unidad de medida.

source: This example displays a very basic slider loop.
es_es: Este ejemplo muestra un bucle deslizante muy básico.

source: It's Super Simple
es_es: Es muy simple

source: Layouts make your theme awesome! With theme options data that you can save/import/export you can package themes with different color variations, or make it easy to do A/B testing on text and so much more. Basically, you save a snapshot of your data as a layout.
es_es: ¡El diseño hace su tema impresionante! Con datos para opciones de tema puede guardar/importar/exportar, puede empaquetar temas con diferentes variaciones de color, o que sea fácil de hacer pruebas A/ B en el texto y mucho más. Básicamente, se guarda una instantánea de los datos como un diseño.

source: Once you have created all your different layouts, or theme variations, you can save them to a separate text file for repackaging with your theme. Alternatively, you could just make different variations for yourself and change your theme with the click of a button, all without deleting your previous options data.
es_es: Una vez que haya creado todos sus diseños diferentes, o variaciones de tema, puede guardarlos en un archivo de texto separado para volver a empaquetar con su tema. Alternativamente, usted podría simplemente hacer diferentes variaciones para usted y cambiar su tema con el clic de un botón, todo ello sin eliminar sus datos de opciones anteriores.
